Tekla Open API Reference for Tekla Structures 2025
AnalysisModelJobProperties Properties
The AnalysisModelJobProperties type exposes the following members.
Properties
Name | Description
ApprovedDate
 The date of the approval.
ApprovedName
 The name of approver.
CheckerDate
 The date of the checking.
CheckerName
 The name of the checker.
ClientName
 The name of the client.
EngineerDate
 The date of the engineering.
EngineerName
 The name of the engineer.
JobComment
 The comment of the job.
JobName
 The name of the job.
JobNumber
 The number of the job.
PartNumber
 The number of the part.
ReferenceNumber
 The reference number.
Top
See Also
Reference
AnalysisModelJobProperties Class
Tekla.Structures.Analysis Namespace